1s/ERP/extensions/liko/InformationRegisters/Лико_СерииНоменклатурыДоп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_СерииНоменклатурыДоп</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЗапаса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/Documents/Лико_ПодготовкаМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_ПодготовкаМатериалов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаменаДопМатериалов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МатериалЗамена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СнятиеРезерва</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НарезкаЗамена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеМатериалыСтрокойЗамена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПриходаМатериалаТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаличиеМатериала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Нарезка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПроверкиНаличияМатериала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаменаНарезки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаменаМатериала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Резервирование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОжидаетсяПриход</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОжидаетсяПереработка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Затрата</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерПроката</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/extensions/liko/CommonModules/Лико_Дополнительно/Ext/Module.bsl
&После("Лико_ОбработкаПолученияФормыОбработкаПолученияФормы")
Процедура Лико_Лико_ОбработкаПолученияФормыОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ТипЗнч(Источник)=Тип("СправочникМенеджер.СерииНоменклатуры")Тогда
		Если ВидФормы = "ФормаСписка" Тогда 		
			СтандартнаяОбработка = Ложь; 
			СтруктураПараметров = Новый Структура;
			ВыбраннаяФорма=Метаданные.Справочники.СерииНоменклатуры.Формы.Лико_ФормаСписка;			
		КонецЕсли; 	
	КонецЕсли;  
КонецПроцедуры

&Вместо("СформироватьТекстДляСкрипта")
Функция Лико_СформироватьТекстДляСкрипта(ЗаказКлиента, НомерМонтажа, Отказ, РасшифровкаОтказа)
	
	
	НомерЗаказа=ЗаказКлиента.НомерБезПрефикса;
	Товары=ЗаказКлиента.Товары.Выгрузить();
	Цвета=ЗаказКлиента.Цвета.Выгрузить();
	Соответствия=ЗаказКлиента.МонтажСоответствия.Выгрузить();
	Схема = ЗаказКлиента.МонтажСхема.Выгрузить();

	Текст = "";
	Спецификация=ЗаказКлиента;
	//СтрокаТовары = Номенклатура;
	//СтрокаТовары=ДокЗаявкаНаДизайн.ЗаказПокупателя.Товары[НомерСтроки-1];

	// параметры штампа
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказКлиента.ШтампВырубной КАК Штамп,
	|	Лико_ПараметрыШтампа.ВидРабот КАК ВидРабот,
	|	Лико_ПараметрыШтампа.ТипШтампа КАК ТипШтампа,
	|	Лико_ПараметрыШтампа.ЭтикетокНаЛисте КАК ЭтикетокНаЛисте,
	|	Лико_ПараметрыШтампа.Нарезка КАК Нарезка,
	|	Лико_ПараметрыШтампа.ШагПечати КАК ШагПечати,
	|	Лико_ПараметрыШтампа.Ручьи КАК Ручьи,
	|	Лико_ПараметрыШтампа.РучьиМин КАК РучьиМин,
	|	Лико_ПараметрыШтампа.Z КАК Z,
	|	Лико_ПараметрыШтампа.ДлинаЭтикетки КАК ДлинаЭтикетки,
	|	Лико_ПараметрыШтампа.ШиринаЭтикетки КАК ШиринаЭтикетки,
	|	Лико_ПараметрыШтампа.ДлинаКольеретки КАК ДлинаКольеретки,
	|	Лико_ПараметрыШтампа.ШиринаКонтрЭтикетки КАК ШиринаКонтрЭтикетки,
	|	Лико_ПараметрыШтампа.ШиринаКольеретки КАК ШиринаКольеретки,
	|	Лико_ПараметрыШтампа.НаправлениеНамотки КАК НаправлениеНамотки,
	|	Лико_ПараметрыШтампа.Цена КАК Цена,
	|	Лико_ПараметрыШтампа.ПорядковыйНомерШтанцыНаВалу КАК ПорядковыйНомерШтанцыНаВалу,
	|	Лико_ПараметрыШтампа.ШиринаПоНожам КАК ШиринаПоНожам,
	|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями КАК ИнтервалМеждуРучьями,
	|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками КАК ИнтервалМеждуЭтикетками
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|		ПО ЗаказКлиента.ШтампВырубной = Лико_ПараметрыШтампа.Номенклатура
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ЗаказКлиента";



	Запрос.УстановитьПараметр("ЗаказКлиента", Спецификация);
	Выборка = Запрос.Выполнить().Выбрать();


	//180-33022						- артикул монтажа, соответствует имени TXT файла
	//314.325						- раппорт (флексо) без сжатия
	//308.265						- раппорт (флексо) со сжатием
	//4								- количество ручьев
	//2								- количество этикет в ручье(по развертке)
	//70							- размер этикеты поперёк полотна
	//155							- размер этикеты вдоль полотна
	//3								- шаг по ножам поперёк полотна(расстояние между ручьями)
	//2.162							- шаг по ножам вдоль полотна
	//стар.211-99/133				- текстовое поле информации для нанесения на рельсу(может быть любой) номер штампа + линиатура печати(из 1С)
	//[forms]						- обозначение начала списка форм
	//Yellow-L40489					- элемент списка форм [используемая краска]-[номер формы]
	//Magenta-L40490				- элемент списка форм
	//Cyan-L40491					- элемент списка форм
	//Pn Purple-F40492				- элемент списка форм
	//Холодное тиснение-40482		- элемент списка форм
	//Black-L40493					- элемент списка форм
	//[articles]					- обозначение начала списка артиклей
	//180-3759						- элемент списка артиклей №1 (соответствует имени дизайнерского и поделеного файла)
	//180-3713						- элемент списка артиклей №2
	//180-33185						- элемент списка артиклей №3
	//180-16965						- элемент списка артиклей №4
	//[montage]						- обозначение начала монтажной схемы
	//1,2,3,4						- монтажная схема ввиде номеров списка артиклей через запятую
	//1,2,3,4						- ручьи в схеме идут вертикально

	Если Выборка.Следующий() Тогда

		//Текст = Текст + Формат(НомерЗаказа, "ЧГ=0"); // номер заказа, соответствует имени TXT файла
		Текст = Текст + Спецификация.НомерБезПрефикса; // код спецификации, соответствует имени TXT файла

		Если ЗначениеЗаполнено(Выборка.Z) Тогда

			Z = Выборка.Z;

			Текст = Текст + Символы.ПС + Выборка.Z.Рапорт; // раппорт (флексо) без сжатия
			Текст = Текст + Символы.ПС + Выборка.Z.РапортВ; // раппорт (флексо) со сжатием
		Иначе

			//Если Не ЗначениеЗаполнено(Выборка.ШагПечати) Тогда
			//	РасшифровкаОтказа = РасшифровкаОтказа + Выборка.Штамп+": У штампа не задан шаг печати.";
			//КонецЕсли;
			//Если Не ЗначениеЗаполнено(Выборка.ЭтикетокНаЛисте) Тогда
			//	РасшифровкаОтказа = РасшифровкаОтказа + Выборка.Штамп+": У штампа не задано количество этикеток на листе.";
			//КонецЕсли;
			//
			//ДлинаЭтикеткиСПрипуском = Выборка.ШагПечати/(Выборка.ЭтикетокНаЛисте/Выборка.Ручьи);
			//ZРапорт = Окр(Цел(0.45/ДлинаЭтикеткиСПрипуском)*ДлинаЭтикеткиСПрипуском,3); // длина печати
			ZРапорт = 0;

			Текст = Текст + Символы.ПС + ZРапорт; // раппорт (флексо) без сжатия
			Текст = Текст + Символы.ПС + ZРапорт; // раппорт (флексо) со сжатием
		КонецЕсли;

		////Текст = Текст + Символы.ПС + Выборка.Ручьи; // количество ручьев
		////Текст = Текст + Символы.ПС + Выборка.ЭтикетокНаЛисте; // количество этикет в ручье(по развертке)
		////
		_ручьиПечати=?(Спецификация.РучьиПечатиИндиго,Спецификация.РучьиПечатиИндиго,
		?(ЗначениеЗаполнено(Спецификация.РучьиПечати),Спецификация.РучьиПечати,Спецификация.Ручьи));
		
		_ручьи=Выборка.Ручьи;
		
	
	Если ЗначениеЗаполнено(Спецификация.ЭтикетокНаЛистеИндиго) Тогда
		лЭтикетокНаЛисте = Спецификация.ЭтикетокНаЛистеИндиго;
	Иначе
		лЭтикетокНаЛисте = ?(ЗначениеЗаполнено(Спецификация.ЭтикетокНаЛистеПечати), Спецификация.ЭтикетокНаЛистеПечати, Спецификация.ЭтикетокНаЛисте);
	КонецЕсли;

		
		
		
		//_ручьи=?(_ручьи=Null,0,_ручьи);
		//_ряды=?(Не ЗначениеЗаполнено(Выборка.Ручьи),0,Выборка.ЭтикетокНаЛисте/Выборка.Ручьи);
		_ряды=?(Не ЗначениеЗаполнено(Выборка.Ручьи),0,Выборка.ЭтикетокНаЛисте/Выборка.Ручьи);

		
		Текст = Текст + Символы.ПС + _ручьиПечати; // количество ручьев
		Текст = Текст + Символы.ПС + ?(Не ЗначениеЗаполнено(Выборка.Ручьи),"",_ряды*_ручьиПечати); // количество этикет в ручье(по развертке)



		Текст = Текст + Символы.ПС + Выборка.ШиринаЭтикетки; // размер этикетки поперёк полотна
		Текст = Текст + Символы.ПС + Выборка.ДлинаЭтикетки; // размер этикетки вдоль полотна
		Текст = Текст + Символы.ПС + Выборка.ИнтервалМеждуРучьями; // шаг по ножам поперёк полотна(расстояние между ручьями)
		Текст = Текст + Символы.ПС + Выборка.ИнтервалМеждуЭтикетками; // шаг по ножам вдоль полотна

		Текст = Текст + Символы.ПС + Выборка.Штамп.Артикул; // текстовое поле информации для нанесения на рельсу(может быть любой) номер штампа + линиатура печати(из 1С)

		Текст = Текст + Символы.ПС + "[forms]"; // обозначение начала списка форм

		Для Каждого СтрокаЦвета Из Цвета Цикл
			Если ЗначениеЗаполнено(СтрокаЦвета.Форма) Тогда
				Если СтрокаЦвета.ВидСекции = Справочники.Лико_ВидыСекций.ОфсетнаяПечать Тогда
					Текст = Текст + Символы.ПС 
					+ ?(ЗначениеЗаполнено(СтрокаЦвета.ТипЦвета1), Строка(СтрокаЦвета.ТипЦвета1)+ " ", "") 
					+ ?(ЗначениеЗаполнено(СтрокаЦвета.ТипКраски), Строка(СтрокаЦвета.ТипКраски)+ " ", "") 
					+ ?(ЗначениеЗаполнено(СтрокаЦвета.Название), Строка(СтрокаЦвета.Название), "") 
					+ "-" + СтрокаЦвета.Форма.Код;
				Иначе
					Текст = Текст + Символы.ПС + СтрЗаменить(СтрокаЦвета.Форма.Наименование, "-", "") + "-" + СтрокаЦвета.Форма.Код;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		Текст = Текст + Символы.ПС + "[articles]"; // обозначение начала списка артиклей

		//Если Товары.Количество()>1 Тогда
		//	
		//	Для Каждого СтрокаТовары Из Товары Цикл
		//		Текст = Текст + Символы.ПС + СтрокаТовары.Номенклатура.Артикул; // элемент списка артиклей
		//	КонецЦикла;
		//	
		//	Текст = Текст + Символы.ПС + "[montage]"; // обозначение начала монтажной схемы
		//	
		//	Текст = Текст + Символы.ПС + СформироватьСхемуМонтажаЭтикеток();
		//КонецЕсли;

		Если НомерМонтажа>0 Тогда

			Для Каждого СтрокаСоответствие Из Соответствия Цикл
				Текст = Текст + Символы.ПС + СтрокаСоответствие.Номенклатура.Артикул; // элемент списка артиклей
			КонецЦикла;

			Текст = Текст + Символы.ПС + "[montage]"; // обозначение начала монтажной схемы

			Текст = Текст + Символы.ПС + СформироватьСхемуМонтажаЭтикеток(Схема, НомерМонтажа);

		КонецЕсли;

	Иначе

		Отказ = Истина;

	КонецЕсли;

	Возврат Текст;

КонецФункции

Процедура ЕстьЗаявкаНаОтгрузку(МассивЗаказов) Экспорт  //+Лико m.shenderov 25.01.2022

	УстановитьПривилегированныйРежим(Истина);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаДок.Ссылка КАК Заказ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Лико_ПараметрыОтрузки.ЗаказКлиента ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьЗаявкаНаОтгрузку,
	|	ЗаказКлиентаДок.ЕстьЗаявкаНаОтгрузку КАК ЕстьЗаявкаНаОтгрузкуЗаказ
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиентаДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыОтрузки КАК Лико_ПараметрыОтрузки
	|		ПО ЗаказКлиентаДок.Ссылка = Лико_ПараметрыОтрузки.ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиентаДок.Ссылка В(&МассивЗаказов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаДок.Ссылка,
	|	ЗаказКлиентаДок.ЕстьЗаявкаНаОтгрузку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.Заказ КАК Заказ,
	|	Вт.ЕстьЗаявкаНаОтгрузку КАК ЕстьЗаявкаНаОтгрузку,
	|	Вт.ЕстьЗаявкаНаОтгрузкуЗаказ КАК ЕстьЗаявкаНаОтгрузкуЗаказ
	|ИЗ
	|	Вт КАК Вт
	|ГДЕ
	|	Вт.ЕстьЗаявкаНаОтгрузку <> Вт.ЕстьЗаявкаНаОтгрузкуЗаказ";
	Запрос.УстановитьПараметр("МассивЗаказов",МассивЗаказов );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект=Выборка.Заказ.ПолучитьОбъект();
		ДокОбъект.ЕстьЗаявкаНаОтгрузку=Выборка.ЕстьЗаявкаНаОтгрузку;
		ДокОбъект.ОбменДанными.Загрузка=Истина;
		ДокОбъект.Записать();		
	КонецЦикла; 
	
	
	
КонецПроцедуры //-Лико m.shenderov 25.01.2022

&Вместо("АктуализацияРезерваМатериаловПоЗаказу")
Процедура Лико_АктуализацияРезерваМатериаловПоЗаказу(Заказ)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|ГДЕ
	|	Лико_ПодготовкаМатериалов.ЗаказКлиента = &Заказ
	|	И Лико_ПодготовкаМатериалов.Проведен
	|	И НЕ Лико_ПодготовкаМатериалов.ПометкаУдаления";
	Запрос.УстановитьПараметр("Заказ",Заказ );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокОбъект=Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.ДополнительныеСвойства.Вставить("НеПроверятьЗаполнениеПолейНастройкаПечать",Истина);
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла; 

	УстановитьПривилегированныйРежим(Ложь);



КонецПроцедуры

&Вместо("ПараметрыПечатиОбъектаНоменклатуры")
Функция Лико_ПараметрыПечатиОбъектаНоменклатуры(ОбъектНоменклатуры, КоличествоЭкземпляров, БыстраяПечать, ПечатьОтветственногоИНомерЗаказа, Количество, ИнфоКамф, ОбъектНабораПараметров, ИмяПринтера)
	УстановитьПривилегированныйРежим(Истина);
	//!ЯССМ_ПечататьКороткийШтрихКодОбъекта = ЯС_Общие.ПолучитьСвойствоОбъекта("ЯССМ_ПечататьКороткийШтрихКодОбъекта",ОбъектНабораПараметров , Ложь);
	ЯССМ_ПечататьКороткийШтрихКодОбъекта=Истина;

	ШКСТрокой = "";

	//!Объект = ОбъектНоменклатуры.ПолучитьОбъект();
	//!КоличествоНаПечать = ?(Количество=0, Объект.Количество, Количество);
	//!КоличествоУУНаПечать = ЯССМ_ОбщийМодуль.РассчитатьКоличествоУУ(ОбъектНоменклатуры, КоличествоНаПечать);

	КоличествоНаПечать = ?(Количество=0, ОбъектНоменклатуры.Количество, Количество);
	// начало Лико Ефимов
	Если Количество = -1 Тогда
		КоличествоНаПечать = 0;
	КонецЕсли;
	// конец Лико Ефимов
	КоличествоУУНаПечать=КоличествоНаПечать*ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель;

	Если ЯССМ_ПечататьКороткийШтрихКодОбъекта Тогда
		ШК = Справочники.ЯССМ_ОбъектыНоменклатуры.ПолучитьКороткийШтрихКод(ОбъектНоменклатуры,ШКСтрокой, КоличествоНаПечать); //длина штрихкода - 15
	Иначе
		ШК = Справочники.ЯССМ_ОбъектыНоменклатуры.ПолучитьКороткийШтрихКод(ОбъектНоменклатуры,ШКСтрокой, КоличествоНаПечать); //длина штрихкода - 30
	КонецЕсли;

	НоменклатураОбъект = ОбъектНоменклатуры.Номенклатура;

	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Ответственный", ?(ПечатьОтветственногоИНомерЗаказа,ФамилияИнициалыФизЛица(ОбъектНоменклатуры.Ответственный), ""));
	//ПараметрыПечати.Вставить("Ответственный",  "");

	Если ЗначениеЗаполнено(ОбъектНоменклатуры.Ответственный) Тогда
		//ДанныеОтветственного = ПолучитьДанныеПоРаботнику(Объект.Ответственный.Ссылка, ТекущаяДата());
		ПараметрыПечати.Вставить("ТабельныйНомерОтветственного", ?(ПечатьОтветственногоИНомерЗаказа, ТабельныйНомерФизЛица(ОбъектНоменклатуры.Ответственный), ""));
	КонецЕсли;
	ВидКонтакта="";
	Попытка
		ВидКонтакта=СтрЗаменить(ОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией.Наименование,"Категория","Кат");
		Если ЗначениеЗаполнено(ВидКонтакта) Тогда
			ВидКонтакта=" ("+ВидКонтакта+")";
		КонецЕсли;

	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	ПараметрыПечати.Вставить("НомерЗаказа", ""+Формат(ОбъектНоменклатуры.НомерЗаказаКлиента, "ЧГ=0")+?(ОбъектНоменклатуры.НомерБланка<>0, "/"+ОбъектНоменклатуры.НомерБланка, ""));
	ПараметрыПечати.Вставить("НомерБланка", "Бл. "+ОбъектНоменклатуры.НомерБланка);

	//+ Лико m.shenderov 04.10.2021
	НомерПроката=ОбъектНоменклатуры.ЗакрытиеБланка.НомерПроката;
	Если  ЗначениеЗаполнено(НомерПроката) Тогда
		ПараметрыПечати.Вставить("НомерБланка", "Бл."+ОбъектНоменклатуры.НомерБланка+"/Пр."+НомерПроката);
	КонецЕсли;
	//- Лико m.shenderov 04.10.2021

	// <-- Начало Лико Яцун С. В. 09.09.2024 
	Если ОбъектНоменклатуры.Номенклатура.ВидНоменклатуры.Наименование = "Рулонные материалы" Тогда
		ПризнакВК = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ПартииПроизводства.Партия КАК Партия
		|ПОМЕСТИТЬ ВТПартия
		|ИЗ
		|	РегистрСведений.Лико_ПартииПроизводства КАК Лико_ПартииПроизводства
		|ГДЕ
		|	Лико_ПартииПроизводства.СерияОбъектНоменклатуры = &СерияОбъектНоменклатуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&СерияОбъектНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПартия.Партия КАК Партия
		|ИЗ
		|	ВТПартия КАК ВТПартия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_РезультатыТестированияМатериалов КАК Лико_РезультатыТестированияМатериалов
		|		ПО (ВТПартия.Партия = Лико_РезультатыТестированияМатериалов.Серия
		|				ИЛИ ВТПартия.Партия = Лико_РезультатыТестированияМатериалов.Серия.ЯССМ_ОбъектНоменклатуры)
		|ГДЕ
		|	Лико_РезультатыТестированияМатериалов.Результат = ЗНАЧЕНИЕ(Перечисление.Лико_ДаНет.Да)
		|	И Лико_РезультатыТестированияМатериалов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ОперацииТестированиеМатериалов.ВходнойКонтроль)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПартия.Партия";

		Запрос.УстановитьПараметр("СерияОбъектНоменклатуры", ОбъектНоменклатуры);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПризнакВК = Истина;
		КонецЦикла;
		ПараметрыПечати.Вставить("ПризнакВК", ?(ПризнакВК,"ВК",""));
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 09.09.2024

	ПараметрыПечати.Вставить("НарезкаВтулка", ?(ЗначениеЗаполнено(ОбъектНоменклатуры.Нарезка), "Ø"+ОбъектНоменклатуры.Нарезка+" ", "") + ?(ЗначениеЗаполнено(ОбъектНоменклатуры.Втулка), "("+ОбъектНоменклатуры.Втулка+")", ""));
	ПараметрыПечати.Вставить("КодНоменклатуры", ОбъектНоменклатуры.КодНоменклатуры+ВидКонтакта);
	ПараметрыПечати.Вставить("Наименование", НоменклатураОбъект.Наименование);
	ПараметрыПечати.Вставить("Артикул", ?(СокрЛП(НоменклатураОбъект.Артикул)="", "", "("+НоменклатураОбъект.Артикул+")"));
	ПараметрыПечати.Вставить("Количество", "" + КоличествоНаПечать);
	ПараметрыПечати.Вставить("КоличествоУУ", "" + КоличествоУУНаПечать);
	ПараметрыПечати.Вставить("БазоваяЕдиницаИзмерения", "" + ОбъектНоменклатуры.БазоваяЕдиницаИзмерения);
	ПараметрыПечати.Вставить("ЕдиницаИзмеренияУУ", "" + ОбъектНоменклатуры.ЕдиницаИзмеренияУУ);
	//ПараметрыПечати.Вставить("ЕдиницаИзмеренияУУПоКлассификатору", "" + ОбъектНоменклатуры.ЕдиницаИзмеренияУУ.ЕдиницаПоКлассификаторуУУ);
	ПараметрыПечати.Вставить("НомерПоставки", ?(ОбъектНоменклатуры.НомерПоставки=0, "", "#" + ОбъектНоменклатуры.НомерПоставки));
	ПараметрыПечати.Вставить("СерийныйНомер", ?(ЗначениеЗаполнено(ОбъектНоменклатуры.НомерПартииИзготовления), "№ п.: "+ОбъектНоменклатуры.НомерПартииИзготовления, ""));
	ПараметрыПечати.Вставить("Дата", Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
	ПараметрыПечати.Вставить("Время", Формат(ТекущаяДата(), "ДЛФ=T"));
	ПараметрыПечати.Вставить("ШК", ШК);
	ПараметрыПечати.Вставить("ДатаПроизводства",?(ЗначениеЗаполнено(ОбъектНоменклатуры.ДатаПроизводства),"Дата пр. :"+ Формат(ОбъектНоменклатуры.ДатаПроизводства, "ДФ=dd.MM.yyyy"),""));
	ПараметрыПечати.Вставить("УпотребитьДо",?(ЗначениеЗаполнено(ОбъектНоменклатуры.УпотребитьДо),"Срок год.:"+ Формат(ОбъектНоменклатуры.УпотребитьДо, "ДФ=dd.MM.yyyy"),""));
	ПараметрыПечати.Вставить("ВидНастроечногоМатериала", ОбъектНоменклатуры.ВидНастроечногоМатериала);
	ПараметрыПечати.Вставить("ЦеноваяГруппа",?(ЗначениеЗаполнено(ОбъектНоменклатуры.Номенклатура.ЦеноваяГруппа.Код),"("+СокрЛП(ОбъектНоменклатуры.Номенклатура.ЦеноваяГруппа.Код)+") ",""));



	// ЮДНИКОв
	//!Если ОбъектНоменклатуры.Праймирование Тогда
	//	ПараметрыПечати.Вставить("Праймирование" , "ПРАЙМИРОВАНИЕ");
	//	ПараметрыПечати.Вставить("ДатаПраймирования", Формат(ОбъектНоменклатуры.ДатаПраймирования, "ДФ=dd.MM.yyyy"));		
	//	ПараметрыПечати.Вставить("Праймёр", ОбщегоНазначения.ФамилияИнициалыФизЛица(ОбъектНоменклатуры.ОтветственныйЗаПраймирование));
	//Иначе
	//	ПараметрыПечати.Вставить("Праймирование" , "");
	//	ПараметрыПечати.Вставить("ДатаПраймирования", "");
	//	ПараметрыПечати.Вставить("Праймёр", "");
	//КонецЕсли;
	//+m.Shenderov 2.09.2016
	//Если ЗначениеЗаполнено(ИнфоКамф) Тогда
	Если ТипЗнч(ИнфоКамф)=Тип("Структура") Тогда
		Для каждого Ключ Из ИнфоКамф Цикл
			ПараметрыПечати.Вставить(Строка(Ключ.Ключ),Ключ.Значение);
		КонецЦикла;
	Иначе	
		ПараметрыПечати.Вставить("ИнфоКамф",ИнфоКамф);
	КонецЕсли;

	ЗаполнитьИнформДляСмеси(ОбъектНоменклатуры,ПараметрыПечати);

	//!ИмяМакета = ЯС_Общие.ПолучитьСвойствоОбъекта("ЯССМ_МакетШКОбъектаНоменклатуры", ОбъектНабораПараметров, "ТСНаклейкаОбъектаНоменклатурыУпр"); 

	ИмяМакета=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("МакетШКОбъектаНоменклатуры","ПФ_MXL_ТСНаклейкаОбъектаНоменклатуры");
	Если ПараметрыПечати.Свойство("Макет") ТОгда
		ИмяМакета=ПараметрыПечати.Макет;
	КонецЕсли;

	Если ОбъектНоменклатуры.Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра Тогда
		ИмяМакета="ПФ_MXL_ТСНаклейкаОбъектаНоменклатурыПолуфабрикат"
	КонецЕсли;

	//ИмяМакета="ПФ_MXL_ТСНаклейкаОбъектаНоменклатуры";
	//!ЯССМ_ПечататьКороткийШтрихКодОбъекта = ЯС_Общие.ПолучитьСвойствоОбъекта("ЯССМ_ПечататьКороткийШтрихКодОбъекта",ОбъектНабораПараметров , Ложь);
	ЯССМ_ПечататьКороткийШтрихКодОбъекта=Истина;
	//-m.shenderov08-09-16	







	Объект = NULL;
	Попытка
		Макет = ПолучитьМакет(ИмяМакета);
	Исключение
		//ЯС_Общие.СообщитьДляКлиента("Не найден макет """ + ИмяМакета + """ для печати штрих-кода объекта номенклатуры! Печать невозможна.", СтатусСообщения.Важное, Ложь);
		//Возврат;
	КонецПопытки;


	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");	

	ТабДокумент = Новый ТабличныйДокумент;
	//ТабДокумент.ИмяПараметровПечати = "ЯССМ_ПАРАМЕТРЫ_ПЕЧАТИ_НаклейкаОбъектаНоменклатуры";
	ТабДокумент.ИмяПараметровПечати = ИмяМакета;


	// Выводим шапку

	//Штрихкод = ОбластьШапка.Области.ШтрихКод.Объект;
	//Штрихкод.Сообщение =ПараметрыПечати.ШК;

	Рисунок = ОбластьШапка.Рисунки.Штрихкод;
	ПараметрыШтрихкода = Новый Структура;

	ПараметрыШтрихкода.Вставить("Ширина",          ОбластьШапка.Рисунки.Штрихкод.Ширина);
	ПараметрыШтрихкода.Вставить("Высота",          ОбластьШапка.Рисунки.Штрихкод.Высота);
	ПараметрыШтрихкода.Вставить("ТипКода",         4);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",    18);
	ПараметрыШтрихкода.Вставить("Штрихкод",        ПараметрыПечати.ШК);
	Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);


	//+ Лико m.shenderov 04.10.2021
	Организация = РегистрыСведений.Лико_СерииНоменклатурыДоп.ОрганизацияВладельцаТовара(ОбъектНоменклатуры.Серия);

	Если Не ЗначениеЗаполнено(Организация) Тогда 	

		Структура=Неопределено;
		ОпределеитьОрганизациюОбъектаНоменклатуры(ОбъектНоменклатуры,Структура);
		Организация=Структура.Организация;

	КонецЕсли;

	Если   Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Тогда
		ШКСТрокой=ШКСТрокой+" (ЛИКО)";
	ИначеЕсли Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИкспак.ЗначениеПараметра Тогда
		ШКСТрокой=ШКСТрокой+" (Х-Pack)";

	КонецЕсли;
	//- Лико m.shenderov 04.10.2021


	ОбластьШапка.Параметры.ШтрихКодСтрокой = ШКСТрокой;	
	ОбластьШапка.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьШапка);

	//ОбъектВывода.Защита = Истина;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ПолеСлева = 1;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ПолеСнизу = 0;
	ТабДокумент.ПолеСверху = 1;


	Если ИмяПринтера="" Тогда
		ИмяПринтера=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ИмяПринтераЭтикеток","");

	КонецЕсли;

	//-m.shenderov 03.10.2016 	

	ТабДокумент.ИмяПринтера = ИмяПринтера;


	Возврат ТабДокумент;
КонецФункции

&Вместо("Подписка_ПриУстановкеНовогоНомера")
Процедура Лико_Подписка_ПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс)
	ТипИсточника = ТипЗнч(Источник);

	//Начало изменений Иванова А.В.
	Если ТипИсточника = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(Источник.Ссылка) Тогда
			Источник.Номер = Источник.Ссылка.Номер;
			Источник.НомерБезПрефикса = Источник.Ссылка.НомерБезПрефикса;	
		Иначе	
			Источник.Номер = Лико_Планирование.ПолучитьНомерДляЗаказа(Источник.Организация, Источник.ТипЗаказа,Источник.ВидЗаказа, Источник.Регион);
			Источник.НомерБезПрефикса = Прав(Источник.Номер,7);	
		КонецЕсли	
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ЗаказДавальца") Тогда
		Если ЗначениеЗаполнено(Источник.Лико_ЗаказКлиента) Тогда 
			Префикс = "0"+Источник.Лико_ЗаказКлиента.НомерБезПрефикса;
			ПрефиксацияОбъектовСобытия.УстановитьПрефиксОрганизации(Источник, СтандартнаяОбработка, Префикс);
		КонецЕсли;	
	ИначеЕсли
		ТипИсточника = Тип("ДокументОбъект.ЗаказНаПроизводство2_2") Тогда
		Если ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.ЗаказДавальца") Тогда 
			Если ЗначениеЗаполнено(Источник.ДокументОснование.Лико_ЗаказКлиента) Тогда
				Префикс = "0"+Источник.ДокументОснование.Лико_ЗаказКлиента.НомерБезПрефикса;
				ПрефиксацияОбъектовСобытия.УстановитьПрефиксОрганизации(Источник, СтандартнаяОбработка, Префикс);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;


	Если ТипИсточника = Тип("ДокументОбъект.Лико_НесоответствующаяПродукция") Тогда
		Если Источник.ВидОперации = Перечисления.Лико_ВидыОперацийНесоответствияЗаказу.ВнутреннийБрак Тогда 
			Префикс = "ВН";
		ИначеЕсли Источник.ВидОперации = Перечисления.Лико_ВидыОперацийНесоответствияЗаказу.РекламацияКлиента Тогда 
			Префикс = "РЕ";
		ИначеЕсли Источник.ВидОперации = Перечисления.Лико_ВидыОперацийНесоответствияЗаказу.Прочее Тогда 
			Префикс = "ПР";

		КонецЕсли;	

		УстановитьПрефиксОрганизации(Источник, Префикс, Ложь, Истина);  //+Лико o.pukhova 31.01.2020

	КонецЕсли;

	//Начало изменений Иванова А.В.




	Если ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Если Источник.Организация<>Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра
			И Источник.Организация<>Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Тогда

			Если Источник.Товары.Количество() > 0 Тогда
				Регион = Источник.Товары[0].Характеристика.Лико_ЗаказНоменклатуры.Регион;
				Если ЗначениеЗаполнено(Регион) Тогда
					СтандартнаяОбработка = Ложь;
					Источник.Номер = ПолучитьНомерДокументаПоРегиону(Источник, Регион, Префикс);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если ТипИсточника = Тип("ДокументОбъект.Лико_ФормированиеПаллета")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ПеремещениеПаллета")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ЗаявкаНаОтгрузку")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ЗаявкаНаТранспортировку")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_Инвентаризация")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_БланкЭтапа")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ПередачаТоваров")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ЗаказНаРаскрой")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_УстановкаВидаНастроечногоМатериала")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ЗаявкаНаДизайн")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ЗаявкаНаИзготовлениеФорм")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ЗаданиеНаУдалениеГП")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ПолучениеГПИзПроизводства")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ЗабраковкаМатериалов")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ВыполненныеРаботыМеждуОрганизациями")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ОтчетФормщика") 
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ФормированиеПаллета2_0")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ПеремещениеПаллета2_0")
		


		Тогда
		ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Источник, СтандартнаяОбработка, Префикс); 
		Если  ТипИсточника = Тип("ДокументОбъект.Лико_ЗаявкаНаДизайн") Тогда
		Префикс= СтрЗаменить(Префикс,"00","");	
		КонецЕсли;
		
		
	КонецЕсли;

	Если ТипИсточника = Тип("ДокументОбъект.Лико_СчетНаОплатуКлиенту") Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = ПроверитьДоговорВДокументеЛико_СчетНаОплатуКлиенту(Источник.Ссылка, Источник.Договор);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;

		Источник.Номер = ПолучитьНомерДокументаДляСчетаНаОплатуКлиенту(Источник, Источник.Договор.Номер); 
	КонецЕсли;

	Если ТипИсточника = Тип("ДокументОбъект.ТС_ЗаявкаНаРемонтРабочихЦентров") Тогда
		Если ЗначениеЗаполнено(Источник.ПодразделениеПолучатель.ПрефиксДляНумерацииДокументов) Тогда
			Префикс = Источник.ПодразделениеПолучатель.ПрефиксДляНумерацииДокументов + "-"; 
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
